# ------------------------
# PyCharm / JetBrains
# ------------------------
.idea/

# ------------------------
# macOS 系统文件
# ------------------------
.DS_Store

# ------------------------
# Python 编译缓存
# ------------------------
__pycache__/
*.py[cod]
*$py.class

# ------------------------
# 虚拟环境目录
# ------------------------
venv/
.env/
*.venv/
ENV/

# ------------------------
# Django 项目特定
# ------------------------
local_settings.py        # 本地配置
db.sqlite3               # 本地数据库（不要上传）
media/                   # 用户上传的文件（一般不用传）
staticfiles/             # collectstatic 后生成的文件

# ------------------------
# Django 迁移文件
# 忽略所有迁移文件，但保留 __init__.py
# ------------------------
*/migrations/*.py
!*/migrations/__init__.py

# ------------------------
# 日志文件
# ------------------------
*.log

# ------------------------
# Windows 系统文件
# ------------------------
Thumbs.db
